In [1]:
import cv2
import numpy as np
import pandas as pd
from PIL import Image
import random
import os

In [51]:
details = pd.read_csv('details3.csv')

In [52]:
details.head()

,Unnamed: 0,Unnamed: 0.1,0,1,2,3,4,5,6
0,0,0,b_car_003001.png,32936,Thirty Two Thousand Nine Hundred Thirty Six only,0,number_0.png,1552017,date_0.png
1,1,1,b_car_003002.png,135662,One Lakh Thirty Five Thousand Six Hundred Sixt...,1,number_1.png,322017,date_1.png
2,2,2,b_car_003003.png,180000,One Lakh Eighty Thousand only,2,number_2.png,472016,date_2.png
3,3,3,b_car_003004.png,764575,Seven Lakh Sixty Four Thousand Five Hundred Se...,3,number_3.png,912017,date_3.png
4,4,4,b_car_003005.png,813000,Eight Lakh Thirteen Thousand only,4,number_4.png,2842017,date_4.png

In [33]:
details.shape

(3000, 9)

In [34]:
type(details)

pandas.core.frame.DataFrame

In [53]:
details = details.drop(details.columns[[0,1]], axis=1)

In [56]:
details.head()

,0,1,2,3,4,5,6
0,b_car_003001.png,32936,Thirty Two Thousand Nine Hundred Thirty Six only,0,number_0.png,1552017,date_0.png
1,b_car_003002.png,135662,One Lakh Thirty Five Thousand Six Hundred Sixt...,1,number_1.png,322017,date_1.png
2,b_car_003003.png,180000,One Lakh Eighty Thousand only,2,number_2.png,472016,date_2.png
3,b_car_003004.png,764575,Seven Lakh Sixty Four Thousand Five Hundred Se...,3,number_3.png,912017,date_3.png
4,b_car_003005.png,813000,Eight Lakh Thirteen Thousand only,4,number_4.png,2842017,date_4.png

In [70]:
amt = details.iloc[:,1]
amt_in_words = details.iloc[:,2]
cheque_no = details.iloc[:,3]
img_abs_path = details.iloc[:,4]
micr_code = details.iloc[:,5]

In [76]:
type(details.loc[0][2])

str